Тобі необхідно реалізувати  систему продажу автобусних квитків  із наступним функціоналом:
- Профіль користувача
- Ролі користувача (адміністратор та покупець)

Адміністратор має можливість:
додавання автобусних рейсів із такими параметрами:
a. Кількість місць
b. Місце відправлення (наприклад, Львів)
c. Дата і Час відправлення (наприклад, 29.06.2017 15:00)
d. Місце прибуття (кінцева та/чи проміжні станції)
e. Час прибуття (кінцева та/чи проміжні станції)
- оновити рейс (якщо жоден із квитків не проданий)
- видалити рейс (якщо жоден із квитків не проданий)
- перегляду списку покупців квитків по кожному рейсу
Покупець має можливість:
                 - переглянути список рейсів (фільтр по місту відправлення та даті відправлення)
- вибрати місце та купити 1 квиток конкретного рейсу (якщо є місця)
- перегляду списку придбаних квитків



